## Plan Result (dts_cftptl_intsvc_acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0] must be replaced
-/+ resource "azurerm_role_assignment" "app-proxy-ga-service-connection-certificate-management" {
      ~ id                               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-ptl-rg/providers/Microsoft.KeyVault/vaults/acmedtscftptlintsvc/providers/Microsoft.Authorization/roleAssignments/9e40cd02-17e4-88e2-9399-ba106e6925d7" -> (known after apply)
      ~ name                             = "9e40cd02-17e4-88e2-9399-ba106e6925d7" -> (known after apply)
      ~ principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> "dad693c4-36ad-468f-94e9-76faa4bc844b" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Authorization/roleDefinitions/a4417e6f-fecd-4de8-b567-7b0420556985" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"","Target":"dts_cftptl_intsvc_acme","Vars":{}} -->